app/controllers/posts_controller.rb

  def show
    @author = @post.author
    @post = Post.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @author = Author.first
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.author_id = @author.id
    @post.save
---
SELECT  "authors".* FROM "authors"  ORDER BY "authors"."id" ASC LIMIT 1
INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["author_id", 1], ["created_at", "2018-11-30 20:27:06.377693"], ["updated_at", "2018-11-30 20:27:06.377693"]]